{"pageProps":{"proposal":{"id":62,"creator":"0x3596390E5FA968E053ed3375db7e4C04F384d0Ee","executor":"0xEE56e2B3D491590B5b31738cC34d5232F378a8D5","targets":["0xe775A3A0A1cdc50bD48d5F47c442A0a4F5F24473","0xA50ba011c48153De246E5192C8f9258A2ba79Ca9"],"signatures":["execute(address,address,address,address,address,uint256,uint256,uint256,uint256,uint8,bool,bool,bool)","setAssetSources(address[],address[])"],"calldatas":["0x000000000000000000000000ae7ab96520de3a18e5e111b5eaab095312d7fe84000000000000000000000000bd233d4ffdaa9b7d1d3e6b18cccb8d091142893a0000000000000000000000008180949ac41ef18e844ff8dafe604a195d86aea9000000000000000000000000de2c414b671d2db93617d1592f0490c13674de24000000000000000000000000ff04ed5f7a6c3a0f1e5ea20617f8c6f513d5a77c0000000000000000000000000000000000000000000000000000000000001b580000000000000000000000000000000000000000000000000000000000001d4c00000000000000000000000000000000000000000000000000000000000029fe00000000000000000000000000000000000000000000000000000000000003e80000000000000000000000000000000000000000000000000000000000000012000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001","0x000000000000000000000000000000000000000000000000000000000000004000000000000000000000000000000000000000000000000000000000000000800000000000000000000000000000000000000000000000000000000000000001000000000000000000000000ae7ab96520de3a18e5e111b5eaab095312d7fe84000000000000000000000000000000000000000000000000000000000000000100000000000000000000000086392dc19c0b719886221c78ab11eb8cf5c52812"],"withDelegatecalls":[true,false],"startBlock":14262018,"endBlock":14281218,"executionTime":1645970311,"forVotes":"572490805621186115466463","againstVotes":"0","executed":true,"canceled":false,"strategy":"0xb7e383ef9B1E9189Fc0F71fb30af8aa14377429e","state":"Executed","minimumQuorum":"200","minimumDiff":"50","executionTimeWithGracePeriod":1646402311,"proposalCreated":14262018,"totalVotingSupply":"16000000000000000000000000","ipfsHash":"0x67d0ca69f88710a443f28a1040f7c9097a77dd1b3893ad951b8d2858d5cfad8e","startTimestamp":1645615121,"creationTimestamp":1645615121,"expirationTimestamp":1645874321},"ipfs":{"title":"Add stETH to AAVE v2","shortDescription":"AAVE governance proposal to enable stETH as a collateral asset","description":"---\ntitle: Add stETH to AAVE v2\nstatus: Proposed\nauthor: Jacob Blish (@jbeezy); Gregory Stepanov (@grstepanov)\nshortDescription: AAVE governance proposal to enable stETH as a collateral asset\ndiscussions: https://governance.aave.com/t/arc-add-support-for-steth-lido/5793\ncreated: 2022-04-02\n---\n\n## Simple Summary\nLido allows users to earn staking rewards on the Ethereum beacon chain without locking Ether or maintaining staking infrastructure. This is done through the stETH token. stETH tokens represent a tokenized staking deposit with staking rewards and slashing penalties applied. stETH can be held, traded, or sold.  \nWe propose listing stETH to AAVE v2 market. This would allow users to borrow against stETH.\n\n#### References\n- Website: [lido.fi](https://lido.fi/)\n- [Primer](https://lido.fi/static/Lido:Ethereum-Liquid-Staking.pdf) \n- [Document portal](https://docs.lido.fi/)\n- [Source code for the system(s) that interact with the proposed asset](https://github.com/lidofinance/lido-dao/blob/master/contracts/0.4.24/Lido.sol)\n- [Ethereum addresses contracts](https://docs.lido.fi/deployed-contracts)\n- [ChainLink Oracle](https://etherscan.io/address/0x86392dC19c0b719886221c78AB11eb8Cf5c52812)\n- [Audits](https://github.com/lidofinance/audits)\n- Community\n    - [Governance forum](https://research.lido.fi/)\n    - [Twitter](https://twitter.com/lidofinance)\n    - [Discord](https://discord.gg/vgdPfhZ)\n    - [Telegram](https://t.me/lidofinance)\n    - [Reddit](https://www.reddit.com/r/LidoFinance)\n\n## Abstract\nThe goal of listing stETH on AAVE v2 market is to provide the ability to deposit stETH into AAVE and allow to use it as collateral. There is no intention to enable borrowing of stETH on AAVE v2 market.\n\n## Motivation\nListing stETH on AAVE can work to attract a larger audience to both AAVE and Lido. More ETH staked with Lido would subsequently benefit the decentralization and security of the Ethereum network, to the benefit of the community as a whole. stETH would likely bring new borrow demand to AAVE as market participants look to borrow against stETH.\n\nstETH makes a perfect DeFi collateral and is beneficial for a number of reasons covered in the Specifications section of this AIP.\n\n## Specification\n1. **What is the link between the author of the AIP and the Asset?**\n\n- Jacob (jbeezy) is a full time member of the DAO working to facilitate integrations for st-Assets across DeFi in protocols such as Aave among others.\n- Gregory (GrStepanov) is a full time protocol contributor working on technical integrations.\n\n2. **Provide a brief high-level overview of the project and the token.**\n\n#### Lido Background\n\nThe Lido Protocol, built on Ethereum’s beacon chain to start, allows users to earn staking rewards on the beacon chain without rendering their assets illiquid or maintaining staking infrastructure.\n\nLido was [announced](https://blog.lido.fi/how-lido-works/) in November 2020. The testnet was released in late November.\n\nLido today has 3 products (stETH, stSOL, bLuna) managed by 4 teams in separate organizations. Across these products is a multi billion dollar TVL and has pushed Lido to #6 on [DeFi Llama rankings](https://defillama.com/protocol/lido). stETH has also been accepted as part of Nexus Mutual’s treasury as part of their [risk management strategy](https://forum.nexusmutual.io/t/proposal-increase-the-allocation-of-the-capital-pool-to-steth/641).\n\nLido has begun the process to move over to a fully non-custodial solution. Details can be found here: [Withdrawal Credentials in Lido](https://blog.lido.fi/withdrawal-credentials-in-lido/).\n\nThe Lido DAO manages the liquid staking protocol by deciding on key parameters (e.g. setting fees, assigning node operators and oracles) through the voting power of governance token holders.\n\nLido has been audited by Sigma Prime, Quantstamp and MixBytes.\n\n#### stETH Background\n\nLido allows users to deposit ETH and receive stETH. The deposited ETH is then pooled and staked with node operators selected by the Lido DAO. stETH represents the user’s staked ETH balance of the beacon chain along with staking rewards accrued or penalties inflicted on validators in the beacon chain. When withdrawals are enabled on the beacon chain, stETH can be redeemed for unstaked ETH and accumulated rewards.\n\nUnlike beacon chain ETH, stETH can be freely transferred and traded. Onboarding stETH to Aave would allow users to borrow against stETH.\n\nThe balance of stETH is based on the total amount of staked ETH plus total staking rewards minus slashing applied on validators. stETH rebases daily.\nThe stETH supply stands at 1,697,460 - worth $5.4BN using current stETH prices.\n\n3. **Explain positioning of token in the AAVE ecosystem. Why would it be a good borrow or collateral asset?**\n\nstETH as DeFi collateral is beneficial for a number of reasons.\n\n- stETH is almost as safe as ETH, price-wise: barring catastrophic scenarios, its value tends to hold the ETH peg well;\n- stETH is a productive asset. Earning rewards on collateral effectively lowers the cost of borrowing. This could make borrowing more attractive on Aave and help to increase market utilization (and therefore Aave’s protocol revenue from \ncoin reserve factors).\n- stETH is a very liquid asset with $5+ billion in liquidity used across [multiple DeFi projects](https://dune.xyz/LidoAnalytical/Integration-monitor-dashboard\n). stETH<>ETH liquidity pool on Curve is the deepest LP in DeFi with $3.8 billion TVL.\n\n4. **Provide a brief history of the project and the different components: DAO (is it live?), products (are they live?). How did it overcome some of the challenges it faced?**\n\nLido protocol background is listed in Question #2.\n\nThere is a DAO and it is live. The Lido DAO consists of, amongst others, Semantic VC, ParaFi Capital, Libertus Capital, Terra, Bitscale Capital, StakeFish, StakingFacilities, Chorus, P2P Capital and KR1, Stani Kulechov of Aave, Banteg of Yearn, Will Harborne of Deversifi, Julien Bouteloup of Stake Capital and Kain Warwick of Synthetix.\n\nThe Lido treasury has been diversified and DAO members now include Paradigm, Three Arrows Capital, DeFiance Capital, Jump Trading, Alameda Research, iFinex, Dragonfly Capital, Delphi Digital, Robot Ventures, Coinbase Ventures, Digital Currency Group, The LAO and [angels](https://research.lido.fi/t/proposal-ldo-treasury-diversification-part-2/506).\n\nThe Lido suite of products consist of st-assets which represent the underlying staked collateral on various protocols. Currently this is stETH, bLuna, stLuna and stSOL and is managed by 4 teams in separate organizations to further mitigate centralization risk.\n\nThere are further wrapped versions to address platform limitations around rebasing assets or bridging to other ecosystem. These wrapped assets are minted/burned based on locking of the st-asset. Currently there is wstETH (non-rebasing) and bETH (Terra representation of stETH).\n\nEarly challenges were overcome with DAO member support, speed of execution and utility of st-assets. The last one is particularly critical in the success of any liquid product.\n\n5. **How is the asset currently used?**\n\nstETH is used in a number of ways.\n\n- a productive asset (e.g. in Nexus Mutual Treasury risk management strategy);\n- compounding yield strategies in DeFI (AMMs, autofarms) (e.g. Convex, Yearn, Harvest);\n- multichain collateral (e.g. wstETH on Ethereum on Maker and bETH on Terra in Anchor).\n\n5. **Emission schedule**\n\nThere is no emission schedule. Similar to DAI, stETH is minted on demand when users lock ETH into the protocol.\n\n6. **Token (& Protocol) permissions (minting) and upgradability. Is there a multisig? What can it do? Who are the signers?**\n\nstETH token is the upgradable contract behind `AppProxyUpgradeable` proxy at https://etherscan.io/address/0xae7ab96520de3a18e5e111b5eaab095312d7fe84. Lido DAO can change the implementation with the successful DAO vote.\n\nThe roles and addresses can be checked in the Aragon UI: https://mainnet.lido.fi/#/lido-dao/permissions/app/0xae7ab96520de3a18e5e111b5eaab095312d7fe84\n\nTo mitigate withdrawal risks, Lido staking went live on December 18th, 2020, through a [withdrawal key ceremony](https://blog.lido.fi/lido-withdrawal-key-ceremony/). Chorus One, Staking Facilities, Certus One, Argent, Banteg (yearn.finance), Alex Svanevik (Nansen), Anton Bukov (1inch), Michael Egorov (Curve/Nucypher), Rune Christensen (MakerDAO), Will Harborne (DeversiFi), and Mustafa Al-Bassam (LazyLedger) came together over a four-day event to generate threshold signatures for Lido’s withdrawal keys in a secure environment on air-gapped machines. \nLido has already migrated to a non-custodial solution and >60% of all stETH already uses this. Details can be found here: [Withdrawal Credentials in Lido](https://blog.lido.fi/withdrawal-credentials-in-lido/).\n\n8. **Market data (Market Cap, 24h Volume, Volatility, Exchanges, Maturity)**\n\n**Market Cap** $5.5B\n\n**Volatility** - Over the past year, stETH proved to hold peg extremely well through various market conditions. [stETH<>ETH balance data for the Curve pool can be found here](https://dune.xyz/queries/36557/72603).\n\n**Volumes and DEXes**\n\n**[Balancer (wstETH/WETH)](https://app.balancer.fi/#/pool/0x32296969ef14eb0c6d29669c550d4a0449130230000200000000000000000080)**  \nLiquidity: $409.3M  \nVolume (24h): $509,3  \nhttps://dune.xyz/embeds/153863/304423/684fdf22-161c-4352-a41d-81ce8a705c01  \n\n**[SushiSwap (wstETH/DAI)](https://analytics.sushi.com/pairs/0xc5578194d457dcce3f272538d1ad52c68d1ce849)**  \nLiquidity: $32.2M  \nVolume (24h): $756,211  \nhttps://dune.xyz/embeds/153729/304165/5c53e046-47ef-485d-9767-6ec188a5629e  \n\n**[Curve (stETH/ETH)](https://curve.fi/steth)**  \nLiquidity: $3,75B  \nVolume (24h): $5,7M  \nhttps://dune.xyz/embeds/153374/303383/9c8cb193-4538-497e-a774-c33e78bcd34d  \n\n9. **Social channels data**\n\n[Discord](https://discord.gg/vgdPfhZ) - 7400 members  \n[Twitter](https://twitter.com/LidoFinance) - 60K followers  \n[GitHub](https://github.com/lidofinance) - Active and managed  \n\n10. **Contracts date of deployments, number of transactions, number of holders for tokens**\n\nDate of Deployment: December 18th, 2020  \nNumber of Transactions (stETH): [146,000+](https://etherscan.io/token/0xae7ab96520de3a18e5e111b5eaab095312d7fe84)  \nUnique holders: [42,000+](https://etherscan.io/token/0xae7ab96520de3a18e5e111b5eaab095312d7fe84)  \n\n11. **Unique Depositors**\n\nUnique depositors: [36,000+](https://dune.xyz/queries/20029/41160)\n\n## Rationale\nstETH represents the user’s staked ETH balance of the beacon chain along with staking rewards accrued or penalties inflicted on validators in the beacon chain.  \nThis is implemented via rebasing mechanism. \n\nDue to the rebasing nature of stETH, the proposed listing implementation involves few changes  to AAVE's generic aToken.\nThe proposed aToken uses underlying stETH shares to store balances and implement the rebase ability. Thus, it has 2 private balances and 1 public balance.\n\n1. The internal (fixed-supply) balance and total supply are used for book-keeping. The deposited balance is stored in stETH shares and converted into the amount of the tokens with functions from stETH. Users’ balances are book-kept with the underlying ERC20 token.\n2. The internal (elastic-supply) balance and total supply correspond to the deposited balance without accrued interest. Rebasing of aSTETH according to stETH happens in this layer.  \n3. The external (elastic-supply) balance and total supply correspond to the deposited balance with interest.\n\nExternally, the aSTETH behaves similar to every other aToken. It always maintains a 1:1 peg with the underlying stETH. \n\nThe current implementation doesn't support borrowing, neither with variable nor with stable interest rates. The stableDebtSTETH and variableDebtSTETH contracts extend default stableDebtToken and variableDebtToken contracts accordingly to make it impossible to use borrowing with aSTETH because default debt tokens are not compatible with the AStETH contract.\n\n## Implementation\n\n#### Code\nAStETH https://etherscan.io/address/0xbd233D4ffdAA9B7d1d3E6b18CCcb8D091142893a  \nvariableDebtSTETH https://etherscan.io/address/0xde2c414b671d2db93617d1592f0490c13674de24  \nstableDebtSTETH https://etherscan.io/address/0x8180949ac41ef18e844ff8dafe604a195d86aea9  \nDefaultReserveInterestRateStrategy https://etherscan.io/address/0xff04ed5f7a6C3a0F1e5Ea20617F8C6f513D5A77c  \nSteps the proposal will execute: start a vote to add stETH as a new asset.\n\n#### Security Considerations\nStandard technical risks of smart contracts apply to the AToken implementation.\nThe implementation has been audited by MixBytes() and considered safe. Read the full report from [here](https://github.com/lidofinance/audits/blob/main/MixBytes%20AAVE%20stETH%20integration%20Security%20Audit%20Report%2002-22.pdf).\n\n**Proposed Risk Parameters**\nLTV: 70%  \nLiquidation Threshold: 75%  \nLiquidation Bonus: 7.5%  \nReserve Factor: 10%  \n\n**Interest Rate Model:**  \nUOptimal: 60%  \nBase: 0%  \nSlope 1: 8%  \nSlope 2: 200%  \n\nAs stETH is more suited as collateral instead of a borrowing asset, we propose listing stETH on AAVE v2 market with borrowing disabled. \n\n## Risk Assessment\n\n**Smart contract risks**\n\nLido faces smart contract risks. To mitigate these, Lido has been audited multiple times - by Quantstamp, Sigma Prime, and MixBytes (see [Audits](https://github.com/lidofinance/audits)), with no critical issues found.\n\n**Counterparty risks**\n\nLido is a DAO. Decisions in the Lido DAO are made through proposals and votes - community members manage protocol parameters, node operators, oracle members, and more. The Lido staking infrastructure for stETH consists of 22 node operators, with a focus on decentralization.\nLido relies on a set of oracles to report staking rewards to the smart contracts. Their maximum possible impact is limited by the [recent upgrade](https://github.com/lidofinance/lido-improvement-proposals/blob/develop/LIPS/lip-2.md#sanity-checks-the-oracles-reports-by-configurable-values) (limit oracles report change by 10% APR increase in stake and 5% decrease in stake), and the operators of oracles are all well-known entities: Stakefish, Certus One, Chorus One, Staking Facilities, DSRV, Blockscape, Everstake, SkillZ, RockX, Allnodes, P2P Validator, and others.\nRead further in Lido [documentation](https://docs.lido.fi/token-guides/steth-superuser-functions/).\n\n**Market risk**\n\nOver the past year, stETH proved to hold the ETH peg 1:1 steadily.\nFour liquidity pools across different DEXes are incentivized with significant LDO rewards. Curve stETH<>ETH LP has grown into the deepest LP across DeFi, which makes it extremely resistant to any attempts of moving the peg.\n\n**Staking risks**\n\nstETH faces staking risks, specifically validator risks including slashing and hostage risks. To mitigate these, Lido works only with best-in-class validators with a track record of success.\nBesides, there's an ongoing [discussion in the community](https://research.lido.fi/t/lip-6-in-protocol-coverage-proposal/1468) about in-protocol coverage options to mitigate slashing risks.\n\n**Price feed risk**\n\nThe ChainLink price feed for stETH is based on the pools with extremely deep liquidity. This makes stETH price very stable and resilient. Manipulating stETH price at this point would require staggering amount of resources and potentially render this kind of attack unreasonable.\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).","ipfsHash":"QmVKuMiNYg8NpLii5EiqTnqixqQanhvjgpDy9e46NX2P3T","originalHash":"0x67d0ca69f88710a443f28a1040f7c9097a77dd1b3893ad951b8d2858d5cfad8e","id":62},"prerendered":true},"__N_SSG":true}