{"pageProps":{"proposal":{"id":88,"creator":"0xB86cB4D6a47c7D50c232793cd61707ad60377A75","executor":"0xEE56e2B3D491590B5b31738cC34d5232F378a8D5","targets":["0xe8ea74754dce51168102e820424F7e7f74C5be3e"],"signatures":["execute()"],"calldatas":["0x"],"withDelegatecalls":[true],"startBlock":15140137,"endBlock":15159337,"executionTime":1658140575,"forVotes":"433551785254240872282745","againstVotes":"0","executed":true,"canceled":false,"strategy":"0xb7e383ef9B1E9189Fc0F71fb30af8aa14377429e","state":"Executed","minimumQuorum":"200","minimumDiff":"50","executionTimeWithGracePeriod":1658572575,"proposalCreated":15140137,"totalVotingSupply":"16000000000000000000000000","ipfsHash":"0xec8fc43da4504c01c0aaf85dec47289e5d3abcc3bc08b90c3018c15acd373644","startTimestamp":1657793335,"creationTimestamp":1657793335,"expirationTimestamp":1658062135},"ipfs":{"title":"Sigma Prime - Security Assessment Services for Aave","status":"Proposed","author":"Sigma Prime (@sigp)","shortDescription":"Proposal for continuous security assessment services from Sigma Prime","discussions":"https://governance.aave.com/t/sigma-prime-security-assessment-services-for-aave/8518","created":"2022-07-12T00:00:00.000Z","preview":"## Summary\n\nThis proposal acts as a mandate from the Aave community …","basename":"3C58C5F00209-AIP-SIGP","description":"\n\n## Summary\n\nThis proposal acts as a mandate from the Aave community to engage [Sigma Prime](https://sigmaprime.io) for continous security assessment services as outlined in [this post](https://governance.aave.com/t/sigma-prime-security-assessment-services-for-aave/8518) and already pre-approved via Snapshot [here](https://snapshot.org/#/aave.eth/proposal/0xf4d2d4c89e29cd11472d5b86f013cb0995952b96099ced35eb91a03e99fbb5cf).\n\n\n## Abstract\n\nThe aim of this proposal is to ensure Aave receives high-quality security assessment services to address all upcoming updates to its protocols, including critical upgrades such as the v2 → v3 migration.\n\n[Sigma Prime](https://sigmaprime.io) has been providing security assessment services to Aave for the past 2.5 years, reviewing critical components such as Aave v2 and v3, along with various other changes made to the lending platform.\n\n## Motivation\n\nAave’s success relies partly on its ability to deliver high quality products with a strong security posture. To date, and despite the large TVL potentially attracting a lot of malicious actors, Aave users haven’t suffered any losses due to smart contract bugs or vulnerabilities. Lately, it has been increasingly difficult to contract reputable smart contract security auditors, as most of the prominent firms in this space are booked out for months.\n\n\n## Specification\n\nThis proposal authorises payment of the minimum engagement fee outlined in [the proposal](https://governance.aave.com/t/sigma-prime-security-assessment-services-for-aave/8518) (US$ 1,296,000) through the following:\n- Upfront payment for 50% of the minimum engagement fee (US$ 648,000) paid in aUSDC and aUSDT (even split, $324,000 each)\n- Remaining 50% (US$ 648,000) paid at the end of the engagement period (12 months) via two (2) payment streams in aUSDC and aUSDT (even split, $324,000 each), with each stream starting 12 months from now, and lasting a duration of 1 second.\n\nIf the maximum fee was to apply to this engagement, a subsequent proposal will be pushed forward for the remaining amount in 12 months (i.e at the end of the engagement period).\n\n\n## Rationale\n\nSigma Prime is an information security consultancy who specialise in Blockchain technology and administered from Sydney, Australia.\n\nThe primary focus of Sigma Prime is to help secure distributed systems through in-depth security assessments of decentralised projects, while concurrently researching and developing core Blockchain infrastructure. Over the past 6 years, we have been working with some of the most prominent organisations in the space: the Ethereum Foundation, Chainlink, SushiSwap, 1inch, the Filecoin Foundation, NEAR, Arbitrum, Lido, Rocket Pool, and plenty of others.\n\nSigma Prime is also the founder and maintainer of the Lighthouse project, an open-source implementation of the Ethereum Proof-of-Stake Consensus specification, written in Rust. Lighthouse is one of the leading Ethereum consensus client implementations and has a particular focus on performance and security.\n\nThroughout the works performed for Aave, the feedback received from the leadership team has been highly positive. Sigma Prime has gained a high degree of familiarity with the protocol, which will be leveraged as required for the delivery of this engagement.\n\n## Test Cases\n\n- Please refer to the [test section](https://github.com/sigp/sigp-aip-payload/tree/master/test) of the [sigp/sigp-aip-payload](https://github.com/sigp/sigp-aip-payload) repository.\n\n## Implementation\n\n- [PayloadAaveSigP](https://etherscan.io/address/0xe8ea74754dce51168102e820424f7e7f74c5be3e#code)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n","ipfsHash":"QmeG65FVH8rVNDpAiNC2Rwsh3RyLdPceoyWj9GLxqUGEUB","originalHash":"0xec8fc43da4504c01c0aaf85dec47289e5d3abcc3bc08b90c3018c15acd373644","id":88},"prerendered":true},"__N_SSG":true}