{"pageProps":{"proposal":{"id":93,"creator":"0x985A29E88E75394DbDaE41a269409f701ccf6a43","executor":"0xEE56e2B3D491590B5b31738cC34d5232F378a8D5","targets":["0x158a6bC04F0828318821baE797f50B0A1299d45b"],"signatures":["execute(address)"],"calldatas":["0x00000000000000000000000083fba23163662149b33dbc05cf1312df6dcba72b"],"withDelegatecalls":[true],"startBlock":15396902,"endBlock":15416102,"executionTime":1661613834,"forVotes":"340080959813177900732858","againstVotes":"285062931334092361303","executed":true,"canceled":false,"strategy":"0xb7e383ef9B1E9189Fc0F71fb30af8aa14377429e","state":"Executed","minimumQuorum":"200","minimumDiff":"50","executionTimeWithGracePeriod":1662045834,"proposalCreated":15396902,"totalVotingSupply":"16000000000000000000000000","ipfsHash":"0xf6e50d5a3f824f5ab4ffa15fb79f4fa1871b8bf7af9e9b32c1aaaa9ea633006d","startTimestamp":1661262202,"creationTimestamp":1661262202,"expirationTimestamp":1661531002},"ipfs":{"title":"Add MAI to Aave V3 on Polygon","status":"Proposed","author":"Pablo Peillard (@itspublu)","shortDescription":"Add MAI Stablecoin to Aave V3 on Polygon","discussions":"https://governance.aave.com/t/add-mai-on-aave-v3/7630","created":"2022-08-16T00:00:00.000Z","preview":"## Author: \nQiDao Protocol core team\n\n## Forum post: \n …","basename":"298883DBD784-AIP-ADD-MAI-TO-AAVE-V3","description":"\n\n## Author: \nQiDao Protocol core team\n\n## Forum post: \n\nhttps://governance.aave.com/t/add-mai-on-aave-v3/7630\nProposal to add support for MAI (aka miMatic) on Aave V3 (On Polygon)\n\n## Summary\n\nMAI is the first and largest native stablecoin project on Polygon and a variety of other chains. It is an overcollateralized stablecoin that is non-custodial. All MAI is backed by collateral locked in user-managed vaults. MAI minting is available on 8 chains, and bridging to 18 chains.\n\nAll accepted collaterals are priced using Chainlink price feeds. MAI has stayed within its peg through several market downturns.\n\nThere’s around 250M MAI minted, with liquidity on all top DEXs in which MAI is present. A significant portion of liquidity for MAI is on Curve. MAI hosts the largest pool on Curve Polygon.\n\n## Risk Parameters\n\nV3 Efficiency mode: stablecoins\nV3 Isolation mode: 75% LTV, 80% liquidation threshold, 10% reserve factor, $2M initial debt ceiling per chain\n\n## Specifications\n**What is the link between the author of the AIP and the Asset?**\n\nCore team at QiDao Protocol.\n\n**Provide a brief high-level overview of the project and the token**\n\nMAI is the first and largest stablecoin protocol on Polygon. It allows users to lock their tokens and use them as collateral to mint MAI at 0% interest.\n\nMAI is an overcollateralized CDP stablecoin on Polygon, Avalanche, Fantom, Arbitrum, Harmony, Moonriver, and Gnosis Chain. MAI is one of the most crosschain assets in DeFi, currently on 18 chains through Multichain. Accepted collateral includes interest-bearing assets like Aave Market Tokens. Users are not charged interest for borrowing MAI - instead, they are charged a 0.5% fee upon repayment.\n\nDespite market downturns during its existence, MAI has maintained its peg.\n\nMAI currently has a TVL of around $90M, and has around 70M MAI outstanding.\n\n**Explain positioning of the token in the AAVE ecosystem. Why would it be a good borrow or collateral asset?**\n\nBeing the largest native stablecoin on Polygon and Fantom, MAI has a wide reach within the native projects on those chains. Listing MAI would connect Aave to most communities in these chains through the integrations already made by MAI.\nMAI is one of the most crosschain assets, available on 18 chains through canonical bridging. As a result, users will be drawn to borrow MAI to bridge value to other chains and take advantage of the many yield opportunities that MAI has.\n\nMAI’s risk profile is low. It is used by large institutions. MAI has also received grants from several blockchains, including Polygon, Metis, Optimism, Arbitrum, and Gnosis.\n\n**Provide a brief history of the project and the different components: DAO (is it live?), products (are the live?). How did it overcome some of the challenges it faced?**\n\nMAI is governed by the QiDao Protocol, a community-run DAO around the QI token.\nSeveral other projects have participated in our DAO through proposals and bribing, including Frax Finance, Stake DAO, Celsius, * PolygonDAO, SpiritSwap, SpookySwap, Gotchi Vault, and Beefy Finance\nThe Polygon Alliance was recently set up to participate in QiDao.\n\n**How is the asset currently used?**\n\nLending (Market.xyz, Impermax, Tarot)\nListed on several DEXs on 18 chains. Main DEXs are Curve, Balancer, QuickSwap, SpookySwap, SpiritSwap, Solidly, Saber, and TombSwap\nTop two pools on Curve Fantom and Polygon\nMAI is used by Celsius to borrow against their AUM\nMAI has been used by Polygon to award bounties\nMAI offers low-cost leverage to strategies on Stake DAO, Yearn, Beefy, and Aave\n\n**Emission schedule**\n\nUsers can mint MAI by locking up their assets and borrowing against that value at 0% interest. Temporary debt ceilings serve as the a supply mitigation.\n\n**Token (& Protocol) permissions (minting) and upgradability.**\n\n**Is there a multisig? What can it do? Who are the signers?**\n\nAll funds stored as collateral are fully controlled by users\nThere is a 3/5 multisig, comprised by the QiDao team. Team members are doxxed and regularly appear on podcasts, live streams, and crypto conferences\nThe multisig executes the results of Snapshot votes: liquidation ratios for new collaterals, partnerships, and debt ceilings. There have been over 70 votes since the start of the DAO: see votes here 1.\nSince the protocol uses canonical bridging, QiDao retains the power to mint MAI on chains it is bridged to.\n\n## Market data (Market Cap, 24h Volume, Volatility, Exchanges, Maturity)\n\n- Market Cap: ~$70M\n- 24h Volume: >$40M\n- Volatility: Low\n- Exchanges: Curve, Balancer, QuickSwap, SpookySwap, SpiritSwap, Saber, Beethoven, Solidly, TombSwap, Solarbeam, Trader Joe, Crodex, ZoomSwap, PaintSwap, Elk Finance, and Rose\n- Maturity: Launched 5/4/21\n- Social channels data (Size of communities, activity on Github)\n- Project: https://www.mai.finance/\n- Defillama: https://defillama.com/protocol/qidao\n- Whitepaper: https://docs.mai.finance/\n- Document portal: https://docs.mai.finance/\n- Source code for the system(s) that interact with the proposed asset: https://github.com/0xlaozi\n- Twitter: 17k followers: https://twitter.com/QiDaoProtocol\n- Telegram: 2,130 members: @QiDaoProtocol\n- Discord: 8,987 members: https://discord.com/qidaoprotocol\n- Contracts date of deployments, number of transactions, number of holders for tokens\nMAI token\n\n- Date of deployment: May 4, 2021\n- Number of transactions: +3M\n- Number of crosschain token holders: 16k+\n\n## Security Considerations\nMAI has undergone 2 thorough audits (linked below). Constant internal reviews are performed to ensure MAI’s economic and technical safety.\n\nThe protocol currently has around $90M TVL.\n\n- First audit: https://uploads-ssl.webflow.com/606120c25fb119221b762612/60bd3b9a1366549deb6a1cf7_Mai_Finance_Audit_Bramah.pdf\n\n- Second audit: https://cloakwire.com/qi-dao-security-audit/\n\n## Other links\n\nContract addresses: https://docs.mai.finance/functions/smart-contract-addresses\n\nChainlink Oracle: 0xd8d483d813547CfB624b8Dc33a00F2fcbCd2D428 (Polygon)\n\n## Proposal's technical implementation\n\nThis asset listing will be executed via Aave's cross-chain governance module, described here [https://github.com/bgd-labs/aave-v3-crosschain-listing-template](https://github.com/bgd-labs/aave-v3-crosschain-listing-template). The listing of miMATIC via cross-chain is one of the examples included there, together with tests.\n\nProposal Payload on Polygon: [https://polygonscan.com/address/0x83fba23163662149b33dbc05cf1312df6dcba72b#code](https://polygonscan.com/address/0x83fba23163662149b33dbc05cf1312df6dcba72b#code)\n\nBGD Labs has provided support on the technical aspects of the listing and Certora has reviewed the proposal's payload.\n","ipfsHash":"QmexRaUuRPSZY9UTKAj1YZCtjc3QzWjSEaUUhUxoFzp37a","originalHash":"0xf6e50d5a3f824f5ab4ffa15fb79f4fa1871b8bf7af9e9b32c1aaaa9ea633006d","id":93},"prerendered":true},"__N_SSG":true}